yashraj0134/Smart-Access-Attendance-Logger-using-STM32-and-ESP32/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : eader for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define D0_PIN_Pin GPIO_PIN_0
#define D0_PIN_GPIO_Port GPIOC
#define D1_PIN_Pin GPIO_PIN_1
#define D1_PIN_GPIO_Port GPIOC
#define D2_PIN_Pin GPIO_PIN_2
#define D2_PIN_GPIO_Port GPIOC
#define D3_PIN_Pin GPIO_PIN_3
#define D3_PIN_GPIO_Port GPIOC
#define D4_PIN_Pin GPIO_PIN_4
#define D4_PIN_GPIO_Port GPIOC
#define D5_PIN_Pin GPIO_PIN_5
#define D5_PIN_GPIO_Port GPIOC
#define D6_PIN_Pin GPIO_PIN_6
#define D6_PIN_GPIO_Port GPIOC
#define D7_PIN_Pin GPIO_PIN_7
#define D7_PIN_GPIO_Port GPIOC
#define RS_PIN_Pin GPIO_PIN_8
#define RS_PIN_GPIO_Port GPIOC
#define EN_PIN_Pin GPIO_PIN_9
#define EN_PIN_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_10
#define LED1_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_11
#define LED2_GPIO_Port GPIOC
#define BUZZER_PIN_Pin GPIO_PIN_2
#define BUZZER_PIN_GPIO_Port GPIOD
#define SPI1_RST_Pin GPIO_PIN_5
#define SPI1_RST_GPIO_Port GPIOB
#define SPI1_CS_Pin GPIO_PIN_6
#define SPI1_CS_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
